# Архитектурный стиль Pipeline для сервиса матчинга
# Status
Proposed
# Context
- Для реализации матчинга нужен заказ, список клиентов, список воркеров (с их характеристиками).
- В [US-300] топ-менеджмент описывает алгоритм матчинга, как Map-Reduce.
- Топ-менеджмент хочет иметь гибкость в настройке шагов
- Подсчет стоимости идет сразу за матчингом
- Нет требований к real-time матчингу
# Decision
**Decision:** монолитная pipeline-архитектура

**Reasoning:**
- В [US-300] менеджмент под map-reduce скорее всего подразумевал то, что решение матчингу основывается на данных и похоже на "воронку": берем всех воркеров и последовательно фильтруем, уходя в все большую и большую детализацию. 
  Так находим самых крутых воркеров под задачу.
- По сути здесь речь идет об обогащении заказа информацией (ETL). На входе заказ без воркера, на выходе заказ с воркером и стоимостью
- Шаги могут часто меняться => лучше сделать монолит, в котором локально можно будет все гибко настраивать и оркестрировать.
- подсчет стоимости идет сразу за матчингом - можно включить его в pipeline обработки.
- Проблемы с масштабируемостью можно игнорировать до некоторой степени, так как нигде не говорилось о том, что матчинг должен был работать в real-time.

# Consequences
- Ограниченная масштабируемость Pipeline косвенно повлияет на масштабируемость по созданию заказов и на косты.
- Слишком большое кол-во шагов в pipeline излишне усложнит всю систему матчинга и её трудно будет фиксить в случае проблем.
